function lab5
syms f(x) y2(x) y3(x);
M = [0.847 1.543 1.834 2.647 2.91;
    -1.104 1.042 0.029 -0.344 -0.449];

f(x) =(x-M(1,1))*(x-M(1,2))*(x-M(1,3))*(x-M(1,4))*(x-M(1,5));
b=[1, 1, 1, 1, 1];
n=0;
%disp("f(x)")
%disp(f(x))
for i=1:5
    for j=1:5
      if(i~=j)
        b(i)=b(i)*(M(1,i)-M(1,j));
      end
 %   disp(b);
    end
    n = n +((((M(2,i))/b(i))));
end
m(x)=n*f(x);
%disp(m(x))
p="-0.572-2.7965*(x-0.351)+0.7606*(x-0.351)*(x-0.867)-0.2085*(x-0.351)*(x-0.867)*(x-3.315)+0.0463*(x-0.351)*(x-0.867)*(x-3.315)*(x-5.013)";
K=zeros(5,6);
R=zeros(5,6);
disp("Многочлен Лагранжа")
disp(p)
disp("L(x1+x2)=")
disp(double(m(M(1,1)+M(1,2))))
disp("Полином Ньютона")
disp(p)
disp("N(x1+x2)=")
disp(double(m(M(1,1)+M(1,2))))
for i=1:5
    K(i,1)=M(1,i);
    R(i,1)=M(1,i);
    K(i,2)=M(2,i);
    R(i,2)=M(2,i);
end
for i=1:4
    for j=3:6
        K(i,j)= K(i+1, j-1)-K(i, j-1);    
        R(i,j)= (R(i+1, j-1)-R(i, j-1))/(R(i+1, 1)-R(1, 1));

    end
end
N=[0.56 0.67 0.9 1.02 1.31 1.64 1.834 2.24 2.67 2.95;
    6.133 2.771 -0.388 -0.788 -0.42 0.066 0.03 -0.374 0.032 -0.14];
P=[0.56 0.67 0.9 1.02 1.31 1.64 1.834 2.24 2.67 2.95;
    6.2 2.9 -0.5 -1 -0.2 0.1 0 -0.5 0.1 -0.2];
R(4,4)=0;
K(4,4)=0;
R(3,5)=0;
K(3,5)=0;
R(4,5)=0;
K(4,5)=0;
for i=2:5
    R(i,6)=0;
    K(i,6)=0;
end
disp('Таблица конечных разностей')
disp(K)
disp('Таблица разделенный разностей')
disp(R)


x = 0.5:0.01:3;
plot(x,m(x),'b',N(1,:), N(2,:),'g',P(1,:), P(2,:),'r');
legend('Полином Лагранжа','Квадратичный сплайн','Линейный сплайн')
end
